MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0E2074CNH/mcu.h
/* ========================================================  PARIOAD  ======================================================== */
 #define R_SRAM_PARIOAD_OAD_Pos            (0UL)    /*!< OAD (Bit 0)                                           */
 #define R_SRAM_PARIOAD_OAD_Msk            (0x1UL)  /*!< OAD (Bitfield-Mask: 0x01)                             */
/* =======================================================  SRAMPRCR  ======================================================== */
 #define R_SRAM_SRAMPRCR_KW_Pos            (1UL)    /*!< KW (Bit 1)                                            */
 #define R_SRAM_SRAMPRCR_KW_Msk            (0xfeUL) /*!< KW (Bitfield-Mask: 0x7f)                              */
 #define R_SRAM_SRAMPRCR_SRAMPRCR_Pos      (0UL)    /*!< SRAMPRCR (Bit 0)                                      */
 #define R_SRAM_SRAMPRCR_SRAMPRCR_Msk      (0x1UL)  /*!< SRAMPRCR (Bitfield-Mask: 0x01)                        */
/* =======================================================  SRAMWTSC  ======================================================== */
/* ========================================================  ECCMODE  ======================================================== */
 #define R_SRAM_ECCMODE_ECCMOD_Pos         (0UL)    /*!< ECCMOD (Bit 0)                                        */
 #define R_SRAM_ECCMODE_ECCMOD_Msk         (0x3UL)  /*!< ECCMOD (Bitfield-Mask: 0x03)                          */
/* ========================================================  ECC2STS  ======================================================== */
 #define R_SRAM_ECC2STS_ECC2ERR_Pos        (0UL)    /*!< ECC2ERR (Bit 0)                                       */
 #define R_SRAM_ECC2STS_ECC2ERR_Msk        (0x1UL)  /*!< ECC2ERR (Bitfield-Mask: 0x01)                         */
/* =======================================================  ECC1STSEN  ======================================================= */
 #define R_SRAM_ECC1STSEN_E1STSEN_Pos      (0UL)    /*!< E1STSEN (Bit 0)                                       */
 #define R_SRAM_ECC1STSEN_E1STSEN_Msk      (0x1UL)  /*!< E1STSEN (Bitfield-Mask: 0x01)                         */
/* ========================================================  ECC1STS  ======================================================== */
 #define R_SRAM_ECC1STS_ECC1ERR_Pos        (0UL)    /*!< ECC1ERR (Bit 0)                                       */
 #define R_SRAM_ECC1STS_ECC1ERR_Msk        (0x1UL)  /*!< ECC1ERR (Bitfield-Mask: 0x01)                         */
/* ========================================================  ECCPRCR  ======================================================== */
 #define R_SRAM_ECCPRCR_KW_Pos             (1UL)    /*!< KW (Bit 1)                                            */
 #define R_SRAM_ECCPRCR_KW_Msk             (0xfeUL) /*!< KW (Bitfield-Mask: 0x7f)                              */
 #define R_SRAM_ECCPRCR_ECCPRCR_Pos        (0UL)    /*!< ECCPRCR (Bit 0)                                       */
 #define R_SRAM_ECCPRCR_ECCPRCR_Msk        (0x1UL)  /*!< ECCPRCR (Bitfield-Mask: 0x01)                         */
/* =======================================================  ECCPRCR2  ======================================================== */
 #define R_SRAM_ECCPRCR2_KW2_Pos           (1UL)    /*!< KW2 (Bit 1)                                           */
 #define R_SRAM_ECCPRCR2_KW2_Msk           (0xfeUL) /*!< KW2 (Bitfield-Mask: 0x7f)                             */
 #define R_SRAM_ECCPRCR2_ECCPRCR2_Pos      (0UL)    /*!< ECCPRCR2 (Bit 0)                                      */
 #define R_SRAM_ECCPRCR2_ECCPRCR2_Msk      (0x1UL)  /*!< ECCPRCR2 (Bitfield-Mask: 0x01)                        */
/* ========================================================  ECCETST  ======================================================== */
 #define R_SRAM_ECCETST_TSTBYP_Pos         (0UL)    /*!< TSTBYP (Bit 0)                                        */
 #define R_SRAM_ECCETST_TSTBYP_Msk         (0x1UL)  /*!< TSTBYP (Bitfield-Mask: 0x01)                          */
/* ========================================================  ECCOAD  ========================================================= */
 #define R_SRAM_ECCOAD_OAD_Pos             (0UL)    /*!< OAD (Bit 0)                                           */
 #define R_SRAM_ECCOAD_OAD_Msk             (0x1UL)  /*!< OAD (Bitfield-Mask: 0x01)                             */
/* =======================================================  SRAMPRCR2  ======================================================= */
 #define R_SRAM_SRAMPRCR2_SRAMPRCR2_Pos    (0UL)    /*!< SRAMPRCR2 (Bit 0)                                     */
 #define R_SRAM_SRAMPRCR2_SRAMPRCR2_Msk    (0x1UL)  /*!< SRAMPRCR2 (Bitfield-Mask: 0x01)                       */
 #define R_SRAM_SRAMPRCR2_KW_Pos           (1UL)    /*!< KW (Bit 1)                                            */
 #define R_SRAM_SRAMPRCR2_KW_Msk           (0xfeUL) /*!< KW (Bitfield-Mask: 0x7f)                              */

/* =========================================================================================================================== */
/* ================                                         R_SYSTEM                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CMC  ========================================================== */
 #define R_SYSTEM_CMC_MODRV_Pos          (0UL)      /*!< MODRV (Bit 0)                                         */
 #define R_SYSTEM_CMC_MODRV_Msk          (0x1UL)    /*!< MODRV (Bitfield-Mask: 0x01)                           */
 #define R_SYSTEM_CMC_SODRV_Pos          (1UL)      /*!< SODRV (Bit 1)                                         */
 #define R_SYSTEM_CMC_SODRV_Msk          (0x6UL)    /*!< SODRV (Bitfield-Mask: 0x03)                           */
 #define R_SYSTEM_CMC_XTSEL_Pos          (3UL)      /*!< XTSEL (Bit 3)                                         */
 #define R_SYSTEM_CMC_XTSEL_Msk          (0x8UL)    /*!< XTSEL (Bitfield-Mask: 0x01)                           */
 #define R_SYSTEM_CMC_SOSEL_Pos          (4UL)      /*!< SOSEL (Bit 4)                                         */
 #define R_SYSTEM_CMC_SOSEL_Msk          (0x10UL)   /*!< SOSEL (Bitfield-Mask: 0x01)                           */
 #define R_SYSTEM_CMC_MOSEL_Pos          (6UL)      /*!< MOSEL (Bit 6)                                         */
 #define R_SYSTEM_CMC_MOSEL_Msk          (0xc0UL)   /*!< MOSEL (Bitfield-Mask: 0x03)                           */
/* =========================================================  SOMRG  ========================================================= */
 #define R_SYSTEM_SOMRG_SOSCMRG_Pos      (0UL)      /*!< SOSCMRG (Bit 0)                                       */
 #define R_SYSTEM_SOMRG_SOSCMRG_Msk      (0x3UL)    /*!< SOSCMRG (Bitfield-Mask: 0x03)                         */
/* ========================================================  MIOTRM  ========================================================= */
 #define R_SYSTEM_MIOTRM_MIOTRM_Pos      (0UL)      /*!< MIOTRM (Bit 0)                                        */
 #define R_SYSTEM_MIOTRM_MIOTRM_Msk      (0xffUL)   /*!< MIOTRM (Bitfield-Mask: 0xff)                          */
/* ========================================================  LIOTRM  ========================================================= */
 #define R_SYSTEM_LIOTRM_LIOTRM_Pos      (0UL)      /*!< LIOTRM (Bit 0)                                        */
 #define R_SYSTEM_LIOTRM_LIOTRM_Msk      (0xffUL)   /*!< LIOTRM (Bitfield-Mask: 0xff)                          */
/* ========================================================  HOCOCR  ========================================================= */
 #define R_SYSTEM_HOCOCR_HCSTP_Pos       (0UL)      /*!< HCSTP (Bit 0)                                         */
 #define R_SYSTEM_HOCOCR_HCSTP_Msk       (0x1UL)    /*!< HCSTP (Bitfield-Mask: 0x01)                           */
/* ========================================================  MOCOCR  ========================================================= */
 #define R_SYSTEM_MOCOCR_MCSTP_Pos       (0UL)      /*!< MCSTP (Bit 0)                                         */
 #define R_SYSTEM_MOCOCR_MCSTP_Msk       (0x1UL)    /*!< MCSTP (Bitfield-Mask: 0x01)                           */
/* ========================================================  LOCOCR  ========================================================= */
 #define R_SYSTEM_LOCOCR_LCSTP_Pos       (0UL)      /*!< LCSTP (Bit 0)                                         */
 #define R_SYSTEM_LOCOCR_LCSTP_Msk       (0x1UL)    /*!< LCSTP (Bitfield-Mask: 0x01)                           */
/* ========================================================  MOSCCR  ========================================================= */
 #define R_SYSTEM_MOSCCR_MOSTP_Pos       (0UL)      /*!< MOSTP (Bit 0)                                         */
 #define R_SYSTEM_MOSCCR_MOSTP_Msk       (0x1UL)    /*!< MOSTP (Bitfield-Mask: 0x01)                           */
/* ========================================================  SOSCCR  ========================================================= */
 #define R_SYSTEM_SOSCCR_SOSTP_Pos       (0UL)      /*!< SOSTP (Bit 0)                                         */
 #define R_SYSTEM_SOSCCR_SOSTP_Msk       (0x1UL)    /*!< SOSTP (Bitfield-Mask: 0x01)                           */
/* =========================================================  OSTC  ========================================================== */
 #define R_SYSTEM_OSTC_MOST_Pos          (0UL)      /*!< MOST (Bit 0)                                          */
 #define R_SYSTEM_OSTC_MOST_Msk          (0xffUL)   /*!< MOST (Bitfield-Mask: 0xff)                            */
/* =========================================================  OSTS  ========================================================== */
 #define R_SYSTEM_OSTS_OSTSB_Pos         (0UL)      /*!< OSTSB (Bit 0)                                         */
 #define R_SYSTEM_OSTS_OSTSB_Msk         (0x7UL)    /*!< OSTSB (Bitfield-Mask: 0x07)                           */
/* =========================================================  OSCSF  ========================================================= */
 #define R_SYSTEM_OSCSF_HOCOSF_Pos       (0UL)      /*!< HOCOSF (Bit 0)                                        */
 #define R_SYSTEM_OSCSF_HOCOSF_Msk       (0x1UL)    /*!< HOCOSF (Bitfield-Mask: 0x01)                          */
/* ========================================================  HOCODIV  ======================================================== */
 #define R_SYSTEM_HOCODIV_DIV_Pos        (0UL)      /*!< DIV (Bit 0)                                           */
 #define R_SYSTEM_HOCODIV_DIV_Msk        (0x7UL)    /*!< DIV (Bitfield-Mask: 0x07)                             */
/* ========================================================  MOCODIV  ======================================================== */
 #define R_SYSTEM_MOCODIV_DIV_Pos        (0UL)      /*!< DIV (Bit 0)                                           */
 #define R_SYSTEM_MOCODIV_DIV_Msk        (0x3UL)    /*!< DIV (Bitfield-Mask: 0x03)                             */
/* ========================================================  MOSCDIV  ======================================================== */
 #define R_SYSTEM_MOSCDIV_DIV_Pos        (0UL)      /*!< DIV (Bit 0)                                           */
 #define R_SYSTEM_MOSCDIV_DIV_Msk        (0x7UL)    /*!< DIV (Bitfield-Mask: 0x07)                             */
/* ========================================================  FOCOSCR  ======================================================== */
 #define R_SYSTEM_FOCOSCR_CKSEL_Pos      (0UL)      /*!< CKSEL (Bit 0)                                         */
 #define R_SYSTEM_FOCOSCR_CKSEL_Msk      (0x1UL)    /*!< CKSEL (Bitfield-Mask: 0x01)                           */
 #define R_SYSTEM_FOCOSCR_CKST_Pos       (1UL)      /*!< CKST (Bit 1)                                          */
 #define R_SYSTEM_FOCOSCR_CKST_Msk       (0x2UL)    /*!< CKST (Bitfield-Mask: 0x01)                            */
/* =======================================================  FMAINSCR  ======================================================== */
 #define R_SYSTEM_FMAINSCR_CKSEL_Pos     (0UL)      /*!< CKSEL (Bit 0)                                         */
 #define R_SYSTEM_FMAINSCR_CKSEL_Msk     (0x1UL)    /*!< CKSEL (Bitfield-Mask: 0x01)                           */
 #define R_SYSTEM_FMAINSCR_CKST_Pos      (1UL)      /*!< CKST (Bit 1)                                          */
 #define R_SYSTEM_FMAINSCR_CKST_Msk      (0x2UL)    /*!< CKST (Bitfield-Mask: 0x01)                            */
/* ========================================================  FSUBSCR  ======================================================== */
 #define R_SYSTEM_FSUBSCR_CKSEL_Pos      (0UL)      /*!< CKSEL (Bit 0)                                         */
 #define R_SYSTEM_FSUBSCR_CKSEL_Msk      (0x1UL)    /*!< CKSEL (Bitfield-Mask: 0x01)                           */
/* ========================================================  ICLKSCR  ======================================================== */
 #define R_SYSTEM_ICLKSCR_CKSEL_Pos      (0UL)      /*!< CKSEL (Bit 0)                                         */
 #define R_SYSTEM_ICLKSCR_CKSEL_Msk      (0x1UL)    /*!< CKSEL (Bitfield-Mask: 0x01)                           */
 #define R_SYSTEM_ICLKSCR_CKST_Pos       (1UL)      /*!< CKST (Bit 1)                                          */
 #define R_SYSTEM_ICLKSCR_CKST_Msk       (0x2UL)    /*!< CKST (Bitfield-Mask: 0x01)                            */
/* =========================================================  OSMC  ========================================================== */
 #define R_SYSTEM_OSMC_WUTMMCK0_Pos      (4UL)      /*!< WUTMMCK0 (Bit 4)                                      */
 #define R_SYSTEM_OSMC_WUTMMCK0_Msk      (0x10UL)   /*!< WUTMMCK0 (Bitfield-Mask: 0x01)                        */
/* =========================================================  RESF  ========================================================== */
 #define R_SYSTEM_RESF_LVIRF_Pos         (0UL)      /*!< LVIRF (Bit 0)                                         */
 #define R_SYSTEM_RESF_LVIRF_Msk         (0x1UL)    /*!< LVIRF (Bitfield-Mask: 0x01)                           */
 #define R_SYSTEM_RESF_RPERF_Pos         (2UL)      /*!< RPERF (Bit 2)                                         */
 #define R_SYSTEM_RESF_RPERF_Msk         (0x4UL)    /*!< RPERF (Bitfield-Mask: 0x01)                           */
 #define R_SYSTEM_RESF_IWDTRF_Pos        (4UL)      /*!< IWDTRF (Bit 4)                                        */
 #define R_SYSTEM_RESF_IWDTRF_Msk        (0x10UL)   /*!< IWDTRF (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_RESF_SWRF_Pos          (5UL)      /*!< SWRF (Bit 5)                                          */
 #define R_SYSTEM_RESF_SWRF_Msk          (0x20UL)   /*!< SWRF (Bitfield-Mask: 0x01)                            */
/* =========================================================  PORSR  ========================================================= */
 #define R_SYSTEM_PORSR_PORF_Pos         (0UL)      /*!< PORF (Bit 0)                                          */
 #define R_SYSTEM_PORSR_PORF_Msk         (0x1UL)    /*!< PORF (Bitfield-Mask: 0x01)                            */
/* ========================================================  LVD1CR  ========================================================= */
 #define R_SYSTEM_LVD1CR_LVD1V_Pos       (0UL)      /*!< LVD1V (Bit 0)                                         */
 #define R_SYSTEM_LVD1CR_LVD1V_Msk       (0x1fUL)   /*!< LVD1V (Bitfield-Mask: 0x1f)                           */
 #define R_SYSTEM_LVD1CR_IRQSEL_Pos      (5UL)      /*!< IRQSEL (Bit 5)                                        */
 #define R_SYSTEM_LVD1CR_IRQSEL_Msk      (0x20UL)   /*!< IRQSEL (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_LVD1CR_LVD1SEL_Pos     (6UL)      /*!< LVD1SEL (Bit 6)                                       */
 #define R_SYSTEM_LVD1CR_LVD1SEL_Msk     (0x40UL)   /*!< LVD1SEL (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_LVD1CR_LVD1EN_Pos      (7UL)      /*!< LVD1EN (Bit 7)                                        */
 #define R_SYSTEM_LVD1CR_LVD1EN_Msk      (0x80UL)   /*!< LVD1EN (Bitfield-Mask: 0x01)                          */
/* ========================================================  LVD1MKR  ======================================================== */
 #define R_SYSTEM_LVD1MKR_MK_Pos         (0UL)      /*!< MK (Bit 0)                                            */
 #define R_SYSTEM_LVD1MKR_MK_Msk         (0x1UL)    /*!< MK (Bitfield-Mask: 0x01)                              */
/* ========================================================  LVD1SR  ========================================================= */
 #define R_SYSTEM_LVD1SR_DET_Pos         (0UL)      /*!< DET (Bit 0)                                           */
 #define R_SYSTEM_LVD1SR_DET_Msk         (0x1UL)    /*!< DET (Bitfield-Mask: 0x01)                             */
 #define R_SYSTEM_LVD1SR_MON_Pos         (1UL)      /*!< MON (Bit 1)                                           */
 #define R_SYSTEM_LVD1SR_MON_Msk         (0x2UL)    /*!< MON (Bitfield-Mask: 0x01)                             */
/* =========================================================  SBYCR  ========================================================= */
 #define R_SYSTEM_SBYCR_FLSTP_Pos        (7UL)      /*!< FLSTP (Bit 7)                                         */
 #define R_SYSTEM_SBYCR_FLSTP_Msk        (0x80UL)   /*!< FLSTP (Bitfield-Mask: 0x01)                           */
 #define R_SYSTEM_SBYCR_FWKUP_Pos        (8UL)      /*!< FWKUP (Bit 8)                                         */
 #define R_SYSTEM_SBYCR_FWKUP_Msk        (0x100UL)  /*!< FWKUP (Bitfield-Mask: 0x01)                           */
 #define R_SYSTEM_SBYCR_RTCLPC_Pos       (9UL)      /*!< RTCLPC (Bit 9)                                        */
 #define R_SYSTEM_SBYCR_RTCLPC_Msk       (0x200UL)  /*!< RTCLPC (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_SBYCR_SSBY_Pos         (15UL)     /*!< SSBY (Bit 15)                                         */
 #define R_SYSTEM_SBYCR_SSBY_Msk         (0x8000UL) /*!< SSBY (Bitfield-Mask: 0x01)                            */
/* =========================================================  PSMCR  ========================================================= */
 #define R_SYSTEM_PSMCR_RAMSD_Pos        (0UL)      /*!< RAMSD (Bit 0)                                         */
 #define R_SYSTEM_PSMCR_RAMSD_Msk        (0x3UL)    /*!< RAMSD (Bitfield-Mask: 0x03)                           */
/* ========================================================  SYOCDCR  ======================================================== */
 #define R_SYSTEM_SYOCDCR_DBGEN_Pos      (7UL)      /*!< DBGEN (Bit 7)                                         */
 #define R_SYSTEM_SYOCDCR_DBGEN_Msk      (0x80UL)   /*!< DBGEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  PRCR  ========================================================== */
 #define R_SYSTEM_PRCR_PRC0_Pos          (0UL)      /*!< PRC0 (Bit 0)                                          */
 #define R_SYSTEM_PRCR_PRC0_Msk          (0x1UL)    /*!< PRC0 (Bitfield-Mask: 0x01)                            */
 #define R_SYSTEM_PRCR_PRC1_Pos          (1UL)      /*!< PRC1 (Bit 1)                                          */
 #define R_SYSTEM_PRCR_PRC1_Msk          (0x2UL)    /*!< PRC1 (Bitfield-Mask: 0x01)                            */
 #define R_SYSTEM_PRCR_PRC3_Pos          (3UL)      /*!< PRC3 (Bit 3)                                          */
 #define R_SYSTEM_PRCR_PRC3_Msk          (0x8UL)    /*!< PRC3 (Bitfield-Mask: 0x01)                            */
 #define R_SYSTEM_PRCR_PRKEY_Pos         (8UL)      /*!< PRKEY (Bit 8)                                         */
 #define R_SYSTEM_PRCR_PRKEY_Msk         (0xff00UL) /*!< PRKEY (Bitfield-Mask: 0xff)                           */
/* ========================================================  MSTPCRA  ======================================================== */
 #define R_SYSTEM_MSTPCRA_MSTPA22_Pos    (6UL)      /*!< MSTPA22 (Bit 6)                                       */
 #define R_SYSTEM_MSTPCRA_MSTPA22_Msk    (0x40UL)   /*!< MSTPA22 (Bitfield-Mask: 0x01)                         */

/* =========================================================================================================================== */
/* ================                                           R_TAU                                           ================ */
/* =========================================================================================================================== */

