MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0E2074CNH/mcu.h
/* ========================================================  TRNGSDR  ======================================================== */
 #define R_TRNG_TRNGSDR_SDATA_Pos       (0UL)    /*!< SDATA (Bit 0)                                         */
 #define R_TRNG_TRNGSDR_SDATA_Msk       (0xffUL) /*!< SDATA (Bitfield-Mask: 0xff)                           */
/* =======================================================  TRNGSCR0  ======================================================== */
 #define R_TRNG_TRNGSCR0_RDRDY_Pos      (7UL)    /*!< RDRDY (Bit 7)                                         */
 #define R_TRNG_TRNGSCR0_RDRDY_Msk      (0x80UL) /*!< RDRDY (Bitfield-Mask: 0x01)                           */
 #define R_TRNG_TRNGSCR0_SGCEN_Pos      (3UL)    /*!< SGCEN (Bit 3)                                         */
 #define R_TRNG_TRNGSCR0_SGCEN_Msk      (0x8UL)  /*!< SGCEN (Bitfield-Mask: 0x01)                           */
 #define R_TRNG_TRNGSCR0_SGSTART_Pos    (2UL)    /*!< SGSTART (Bit 2)                                       */
 #define R_TRNG_TRNGSCR0_SGSTART_Msk    (0x4UL)  /*!< SGSTART (Bitfield-Mask: 0x01)                         */
/* =======================================================  TRNGSCR1  ======================================================== */
 #define R_TRNG_TRNGSCR1_INTEN_Pos      (0UL)    /*!< INTEN (Bit 0)                                         */
 #define R_TRNG_TRNGSCR1_INTEN_Msk      (0x1UL)  /*!< INTEN (Bitfield-Mask: 0x01)                           */

/* =========================================================================================================================== */
/* ================                                         R_UARTA0                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  TXBAn  ========================================================= */
/* =========================================================  RXBAn  ========================================================= */
/* ========================================================  ASIMAn0  ======================================================== */
 #define R_UARTA0_ASIMAn0_ISRMA_Pos    (0UL)    /*!< ISRMA (Bit 0)                                         */
 #define R_UARTA0_ASIMAn0_ISRMA_Msk    (0x1UL)  /*!< ISRMA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASIMAn0_ISSMA_Pos    (1UL)    /*!< ISSMA (Bit 1)                                         */
 #define R_UARTA0_ASIMAn0_ISSMA_Msk    (0x2UL)  /*!< ISSMA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASIMAn0_RXEA_Pos     (5UL)    /*!< RXEA (Bit 5)                                          */
 #define R_UARTA0_ASIMAn0_RXEA_Msk     (0x20UL) /*!< RXEA (Bitfield-Mask: 0x01)                            */
 #define R_UARTA0_ASIMAn0_TXEA_Pos     (6UL)    /*!< TXEA (Bit 6)                                          */
 #define R_UARTA0_ASIMAn0_TXEA_Msk     (0x40UL) /*!< TXEA (Bitfield-Mask: 0x01)                            */
 #define R_UARTA0_ASIMAn0_EN_Pos       (7UL)    /*!< EN (Bit 7)                                            */
 #define R_UARTA0_ASIMAn0_EN_Msk       (0x80UL) /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  ASIMAn1  ======================================================== */
 #define R_UARTA0_ASIMAn1_ALV_Pos      (0UL)    /*!< ALV (Bit 0)                                           */
 #define R_UARTA0_ASIMAn1_ALV_Msk      (0x1UL)  /*!< ALV (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASIMAn1_DIR_Pos      (1UL)    /*!< DIR (Bit 1)                                           */
 #define R_UARTA0_ASIMAn1_DIR_Msk      (0x2UL)  /*!< DIR (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASIMAn1_SL_Pos       (2UL)    /*!< SL (Bit 2)                                            */
 #define R_UARTA0_ASIMAn1_SL_Msk       (0x4UL)  /*!< SL (Bitfield-Mask: 0x01)                              */
 #define R_UARTA0_ASIMAn1_CL_Pos       (3UL)    /*!< CL (Bit 3)                                            */
 #define R_UARTA0_ASIMAn1_CL_Msk       (0x18UL) /*!< CL (Bitfield-Mask: 0x03)                              */
 #define R_UARTA0_ASIMAn1_PS_Pos       (5UL)    /*!< PS (Bit 5)                                            */
 #define R_UARTA0_ASIMAn1_PS_Msk       (0x60UL) /*!< PS (Bitfield-Mask: 0x03)                              */
/* ========================================================  BRGCAn  ========================================================= */
/* ========================================================  ASISAn  ========================================================= */
 #define R_UARTA0_ASISAn_OVEA_Pos      (0UL)    /*!< OVEA (Bit 0)                                          */
 #define R_UARTA0_ASISAn_OVEA_Msk      (0x1UL)  /*!< OVEA (Bitfield-Mask: 0x01)                            */
 #define R_UARTA0_ASISAn_FEA_Pos       (1UL)    /*!< FEA (Bit 1)                                           */
 #define R_UARTA0_ASISAn_FEA_Msk       (0x2UL)  /*!< FEA (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASISAn_PEA_Pos       (2UL)    /*!< PEA (Bit 2)                                           */
 #define R_UARTA0_ASISAn_PEA_Msk       (0x4UL)  /*!< PEA (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASISAn_TXSFA_Pos     (4UL)    /*!< TXSFA (Bit 4)                                         */
 #define R_UARTA0_ASISAn_TXSFA_Msk     (0x10UL) /*!< TXSFA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASISAn_TXBFA_Pos     (5UL)    /*!< TXBFA (Bit 5)                                         */
 #define R_UARTA0_ASISAn_TXBFA_Msk     (0x20UL) /*!< TXBFA (Bitfield-Mask: 0x01)                           */
/* ========================================================  ASCTAn  ========================================================= */
 #define R_UARTA0_ASCTAn_OVECTA_Pos    (0UL)    /*!< OVECTA (Bit 0)                                        */
 #define R_UARTA0_ASCTAn_OVECTA_Msk    (0x1UL)  /*!< OVECTA (Bitfield-Mask: 0x01)                          */
 #define R_UARTA0_ASCTAn_FECTA_Pos     (1UL)    /*!< FECTA (Bit 1)                                         */
 #define R_UARTA0_ASCTAn_FECTA_Msk     (0x2UL)  /*!< FECTA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASCTAn_PECTA_Pos     (2UL)    /*!< PECTA (Bit 2)                                         */
 #define R_UARTA0_ASCTAn_PECTA_Msk     (0x4UL)  /*!< PECTA (Bitfield-Mask: 0x01)                           */

/* =========================================================================================================================== */
/* ================                                        R_UARTA_CK                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  UTAnCK  ========================================================= */
 #define R_UARTA_CK_UTAnCK_CK_Pos     (0UL)    /*!< CK (Bit 0)                                            */
 #define R_UARTA_CK_UTAnCK_CK_Msk     (0xfUL)  /*!< CK (Bitfield-Mask: 0x0f)                              */
 #define R_UARTA_CK_UTAnCK_SEL_Pos    (4UL)    /*!< SEL (Bit 4)                                           */
 #define R_UARTA_CK_UTAnCK_SEL_Msk    (0x30UL) /*!< SEL (Bitfield-Mask: 0x03)                             */
 #define R_UARTA_CK_UTAnCK_EN_Pos     (7UL)    /*!< EN (Bit 7)                                            */
 #define R_UARTA_CK_UTAnCK_EN_Msk     (0x80UL) /*!< EN (Bitfield-Mask: 0x01)                              */

/* =========================================================================================================================== */
/* ================                                          R_RTC_C                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  SEC  ========================================================== */
 #define R_RTC_C_SEC_SEC1_Pos          (0UL)    /*!< SEC1 (Bit 0)                                          */
 #define R_RTC_C_SEC_SEC1_Msk          (0xfUL)  /*!< SEC1 (Bitfield-Mask: 0x0f)                            */
 #define R_RTC_C_SEC_SEC10_Pos         (4UL)    /*!< SEC10 (Bit 4)                                         */
 #define R_RTC_C_SEC_SEC10_Msk         (0x70UL) /*!< SEC10 (Bitfield-Mask: 0x07)                           */
/* ==========================================================  MIN  ========================================================== */
 #define R_RTC_C_MIN_MIN1_Pos          (0UL)    /*!< MIN1 (Bit 0)                                          */
 #define R_RTC_C_MIN_MIN1_Msk          (0xfUL)  /*!< MIN1 (Bitfield-Mask: 0x0f)                            */
 #define R_RTC_C_MIN_MIN10_Pos         (4UL)    /*!< MIN10 (Bit 4)                                         */
 #define R_RTC_C_MIN_MIN10_Msk         (0x70UL) /*!< MIN10 (Bitfield-Mask: 0x07)                           */
/* =========================================================  HOUR  ========================================================== */
 #define R_RTC_C_HOUR_HOUR1_Pos        (0UL)    /*!< HOUR1 (Bit 0)                                         */
 #define R_RTC_C_HOUR_HOUR1_Msk        (0xfUL)  /*!< HOUR1 (Bitfield-Mask: 0x0f)                           */
 #define R_RTC_C_HOUR_HOUR10_Pos       (4UL)    /*!< HOUR10 (Bit 4)                                        */
 #define R_RTC_C_HOUR_HOUR10_Msk       (0x30UL) /*!< HOUR10 (Bitfield-Mask: 0x03)                          */
/* =========================================================  WEEK  ========================================================== */
 #define R_RTC_C_WEEK_WEEK_Pos         (0UL)    /*!< WEEK (Bit 0)                                          */
 #define R_RTC_C_WEEK_WEEK_Msk         (0x7UL)  /*!< WEEK (Bitfield-Mask: 0x07)                            */
/* ==========================================================  DAY  ========================================================== */
 #define R_RTC_C_DAY_DAY1_Pos          (0UL)    /*!< DAY1 (Bit 0)                                          */
 #define R_RTC_C_DAY_DAY1_Msk          (0xfUL)  /*!< DAY1 (Bitfield-Mask: 0x0f)                            */
 #define R_RTC_C_DAY_DAY10_Pos         (4UL)    /*!< DAY10 (Bit 4)                                         */
 #define R_RTC_C_DAY_DAY10_Msk         (0x30UL) /*!< DAY10 (Bitfield-Mask: 0x03)                           */
/* =========================================================  MONTH  ========================================================= */
 #define R_RTC_C_MONTH_MONTH1_Pos      (0UL)    /*!< MONTH1 (Bit 0)                                        */
 #define R_RTC_C_MONTH_MONTH1_Msk      (0xfUL)  /*!< MONTH1 (Bitfield-Mask: 0x0f)                          */
 #define R_RTC_C_MONTH_MONTH10_Pos     (4UL)    /*!< MONTH10 (Bit 4)                                       */
 #define R_RTC_C_MONTH_MONTH10_Msk     (0x10UL) /*!< MONTH10 (Bitfield-Mask: 0x01)                         */
/* =========================================================  YEAR  ========================================================== */
 #define R_RTC_C_YEAR_YEAR1_Pos        (0UL)    /*!< YEAR1 (Bit 0)                                         */
 #define R_RTC_C_YEAR_YEAR1_Msk        (0xfUL)  /*!< YEAR1 (Bitfield-Mask: 0x0f)                           */
 #define R_RTC_C_YEAR_YEAR10_Pos       (4UL)    /*!< YEAR10 (Bit 4)                                        */
 #define R_RTC_C_YEAR_YEAR10_Msk       (0xf0UL) /*!< YEAR10 (Bitfield-Mask: 0x0f)                          */
/* ========================================================  SUBCUD  ========================================================= */
 #define R_RTC_C_SUBCUD_F_Pos          (0UL)    /*!< F (Bit 0)                                             */
 #define R_RTC_C_SUBCUD_F_Msk          (0x3fUL) /*!< F (Bitfield-Mask: 0x3f)                               */
 #define R_RTC_C_SUBCUD_F6_Pos         (6UL)    /*!< F6 (Bit 6)                                            */
 #define R_RTC_C_SUBCUD_F6_Msk         (0x40UL) /*!< F6 (Bitfield-Mask: 0x01)                              */
 #define R_RTC_C_SUBCUD_DEV_Pos        (7UL)    /*!< DEV (Bit 7)                                           */
 #define R_RTC_C_SUBCUD_DEV_Msk        (0x80UL) /*!< DEV (Bitfield-Mask: 0x01)                             */
/* ========================================================  ALARMWM  ======================================================== */
 #define R_RTC_C_ALARMWM_WM1_Pos       (0UL)    /*!< WM1 (Bit 0)                                           */
 #define R_RTC_C_ALARMWM_WM1_Msk       (0xfUL)  /*!< WM1 (Bitfield-Mask: 0x0f)                             */
 #define R_RTC_C_ALARMWM_WM10_Pos      (4UL)    /*!< WM10 (Bit 4)                                          */
 #define R_RTC_C_ALARMWM_WM10_Msk      (0x70UL) /*!< WM10 (Bitfield-Mask: 0x07)                            */
/* ========================================================  ALARMWH  ======================================================== */
 #define R_RTC_C_ALARMWH_WH1_Pos       (0UL)    /*!< WH1 (Bit 0)                                           */
 #define R_RTC_C_ALARMWH_WH1_Msk       (0xfUL)  /*!< WH1 (Bitfield-Mask: 0x0f)                             */
 #define R_RTC_C_ALARMWH_WH10_Pos      (4UL)    /*!< WH10 (Bit 4)                                          */
 #define R_RTC_C_ALARMWH_WH10_Msk      (0x30UL) /*!< WH10 (Bitfield-Mask: 0x03)                            */
/* ========================================================  ALARMWW  ======================================================== */
 #define R_RTC_C_ALARMWW_WW0_Pos       (0UL)    /*!< WW0 (Bit 0)                                           */
 #define R_RTC_C_ALARMWW_WW0_Msk       (0x1UL)  /*!< WW0 (Bitfield-Mask: 0x01)                             */
 #define R_RTC_C_ALARMWW_WW1_Pos       (1UL)    /*!< WW1 (Bit 1)                                           */
 #define R_RTC_C_ALARMWW_WW1_Msk       (0x2UL)  /*!< WW1 (Bitfield-Mask: 0x01)                             */
 #define R_RTC_C_ALARMWW_WW2_Pos       (2UL)    /*!< WW2 (Bit 2)                                           */
 #define R_RTC_C_ALARMWW_WW2_Msk       (0x4UL)  /*!< WW2 (Bitfield-Mask: 0x01)                             */
 #define R_RTC_C_ALARMWW_WW3_Pos       (3UL)    /*!< WW3 (Bit 3)                                           */
 #define R_RTC_C_ALARMWW_WW3_Msk       (0x8UL)  /*!< WW3 (Bitfield-Mask: 0x01)                             */
 #define R_RTC_C_ALARMWW_WW4_Pos       (4UL)    /*!< WW4 (Bit 4)                                           */
 #define R_RTC_C_ALARMWW_WW4_Msk       (0x10UL) /*!< WW4 (Bitfield-Mask: 0x01)                             */
 #define R_RTC_C_ALARMWW_WW5_Pos       (5UL)    /*!< WW5 (Bit 5)                                           */
 #define R_RTC_C_ALARMWW_WW5_Msk       (0x20UL) /*!< WW5 (Bitfield-Mask: 0x01)                             */
 #define R_RTC_C_ALARMWW_WW6_Pos       (6UL)    /*!< WW6 (Bit 6)                                           */
 #define R_RTC_C_ALARMWW_WW6_Msk       (0x40UL) /*!< WW6 (Bitfield-Mask: 0x01)                             */
/* =========================================================  RTCC0  ========================================================= */
 #define R_RTC_C_RTCC0_CT_Pos          (0UL)    /*!< CT (Bit 0)                                            */
 #define R_RTC_C_RTCC0_CT_Msk          (0x7UL)  /*!< CT (Bitfield-Mask: 0x07)                              */
 #define R_RTC_C_RTCC0_AMPM_Pos        (3UL)    /*!< AMPM (Bit 3)                                          */
 #define R_RTC_C_RTCC0_AMPM_Msk        (0x8UL)  /*!< AMPM (Bitfield-Mask: 0x01)                            */
 #define R_RTC_C_RTCC0_RTC128EN_Pos    (4UL)    /*!< RTC128EN (Bit 4)                                      */
 #define R_RTC_C_RTCC0_RTC128EN_Msk    (0x10UL) /*!< RTC128EN (Bitfield-Mask: 0x01)                        */
 #define R_RTC_C_RTCC0_RCLOE1_Pos      (5UL)    /*!< RCLOE1 (Bit 5)                                        */
 #define R_RTC_C_RTCC0_RCLOE1_Msk      (0x20UL) /*!< RCLOE1 (Bitfield-Mask: 0x01)                          */
 #define R_RTC_C_RTCC0_RTCE_Pos        (7UL)    /*!< RTCE (Bit 7)                                          */
 #define R_RTC_C_RTCC0_RTCE_Msk        (0x80UL) /*!< RTCE (Bitfield-Mask: 0x01)                            */
/* =========================================================  RTCC1  ========================================================= */
 #define R_RTC_C_RTCC1_RWAIT_Pos       (0UL)    /*!< RWAIT (Bit 0)                                         */
 #define R_RTC_C_RTCC1_RWAIT_Msk       (0x1UL)  /*!< RWAIT (Bitfield-Mask: 0x01)                           */
 #define R_RTC_C_RTCC1_RWST_Pos        (1UL)    /*!< RWST (Bit 1)                                          */
 #define R_RTC_C_RTCC1_RWST_Msk        (0x2UL)  /*!< RWST (Bitfield-Mask: 0x01)                            */
 #define R_RTC_C_RTCC1_RIFG_Pos        (3UL)    /*!< RIFG (Bit 3)                                          */
 #define R_RTC_C_RTCC1_RIFG_Msk        (0x8UL)  /*!< RIFG (Bitfield-Mask: 0x01)                            */
 #define R_RTC_C_RTCC1_WAFG_Pos        (4UL)    /*!< WAFG (Bit 4)                                          */
 #define R_RTC_C_RTCC1_WAFG_Msk        (0x10UL) /*!< WAFG (Bitfield-Mask: 0x01)                            */
 #define R_RTC_C_RTCC1_WALIE_Pos       (6UL)    /*!< WALIE (Bit 6)                                         */
 #define R_RTC_C_RTCC1_WALIE_Msk       (0x40UL) /*!< WALIE (Bitfield-Mask: 0x01)                           */
 #define R_RTC_C_RTCC1_WALE_Pos        (7UL)    /*!< WALE (Bit 7)                                          */
 #define R_RTC_C_RTCC1_WALE_Msk        (0x80UL) /*!< WALE (Bitfield-Mask: 0x01)                            */

/** @} */ /* End of group PosMask_peripherals */

 #ifdef __cplusplus
}
 #endif

#endif                                 /* R7FA0E209_H */

/** @} */ /* End of group R7FA0E209 */

/** @} */ /* End of group Renesas Electronics Corporation */
